
Процедура Топаз_ПродажиПоТопливнымКартамОбработкаПроведенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
		Источник.Движения.Топаз_ПродажиПоТопливнымКартам.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Источник.Товары Цикл
		Если ЗначениеЗаполнено (ТекСтрокаТовары.ТопливнаяКарта) Тогда
		Движение = Источник.Движения.Топаз_ПродажиПоТопливнымКартам.Добавить();
		Движение.Период = Источник.Дата;
		Движение.Склад = ТекСтрокаТовары.Склад;
		Движение.Контрагент = Источник.Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Топаз_ТопливнаяКарта = ТекСтрокаТовары.ТопливнаяКарта;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		КонецЕсли;
	КонецЦикла;

	
	
КонецПроцедуры
